"use strict";

// №1⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = '5' + '2';
// alert(a);

//'52'

// №2⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = '5' + 2;
// alert(a);

//'52'

// ⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = 5 + '2';
// alert(a);

// '52'

// №4⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = 5 + 2;
// alert(a);

//7

// №5⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:
// let a = '5' * '2';
// alert(a);

//10

// №6⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = '5' - '2';
// alert(a);

// 3

// №7⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = '5' / '2';
// alert(a);

//2.5

// №8⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = '5' % '2';
// alert(a);

//1

// №9⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = '5s' * '2';
// alert(a);

//NaN

// №10⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = '5s' + '2';
// alert(a);

//'5s2'

// ⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = (-'5') + (-'2');
// alert(a);

//-7

// №12⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = '5' * 1 + '2' * 1;
// alert(a);

//7

// №13⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = '5' * '1' + '2' * '1';
// alert(a);

//7

// №14⊗jsPmBsATC
// Не запуская код, определите, что выведется на экран:

// let a = '' + 3 + 1;
// alert(a);

//'31'