"use strict";

// №1⊗jsPmBsNE
// Дана переменная со значением '5px' и переменная со значением '6px'. Найдите сумму пикселей из значений этих переменных и выведите ее на экран.
// let a = '5px';
// let b = '6px';

// let res = parseInt(a) + parseInt(b);
// console.log(res);

// №2⊗jsPmBsNE
// Дана переменная со значением '5.5px' и переменная со значением '6.25px'. Найдите сумму пикселей из значений этих переменных и выведите ее на экран.

// let a = '5,5px';
// let b = '6.25px';
// let res = parseFloat(a) + parseFloat(b);

// №3⊗jsPmBsNE
// Модифицируйте предыдущую задачу так, чтобы к выводящемуся результату добавлялись буквы 'px'. То есть, если наша сумма равна 11.75, то на экран пусть выведется '11.75px'.

// let a = '5,5px';
// let b = '6.25px';
// let unit = 'px';
// let res = parseFloat(a) + parseFloat(b) + unit;
// console.log(res);