"use strict";

// №1⊗jsPmBsSV
// Объявите переменную, не задавая ей значения. Выведите значение созданной переменной на экран.
// let value;
// alert(value);

// №2⊗jsPmBsSV
// Присвойте переменной значение null. Выведите эту переменную на экран.
// let str = null;
// alert(null);

// №3⊗jsPmBsSV
// Присвойте переменной значение true. Выведите эту переменную на экран.

// let flag = true;

// №4⊗jsPmBsSV
// Присвойте переменной значение false. Выведите эту переменную на экран.
// let flag = false;


// №5⊗jsPmBsSV
// Сделайте две строки. Перемножьте их друг на друга. Выведите результат умножения на экран.

// let str1 = 'ghdbt';
// let str2 = 'dfcz';

// alert(str1 * str2);

// №6⊗jsPmBsSV
// Поделите число 10 на 0. Выведите результат на экран.
// №7⊗jsPmBsSV
// Поделите число -10 на 0. Выведите результат на экран.

// alert(10 / 0);
// alert(-10 / 0);