"use strict";

// Не запуская код, определите, что выведется на экран:

// let a = 5 + 5 * 3;
// alert(a);

// 5 * 3 = 15 + 5 = 20;

// let a = 5 + 5 * 3 + 3;
// alert(a);

// 5 * 3 = 15 + 5 + 3 = 23;

// let a = 8 / 2 + 2;
// alert(a);

// 8 / 2 = 4 + 2 = 6;

// let a = 8 + 2 / 2;
// alert(a);

// 2 / 2 = 1 + 8 = 9;

// let a = 8 / 2 * 2;
// alert(a);

// 8 / 2 = 4 * 2 = 8

// let a = 8 * 4 / 2 / 2;
// alert(a);

// 8 * 4 = 32 / 2 = 16 / 2 = 8;

// let a = (2 + 3) * (2 + 3);
// alert(a);

// 2 + 3 = 5, 2 + 3 = 5 * 5 = 25;

// let a = (2 + 3) * 2 + 3;
// alert(a);

//2 + 3 = 5 * 2 = 10 + 3 = 13;

// let a = 2 * (2 + 4 * (3 + 1));
// alert(a);

//3 + 1 = 4 * 4 = 16 + 2 = 18 * 2 = 32;

// let a = 2 * 8 / 4;
// alert(a);

//2 * 8 = 16 / 4 = 4;

// let a = (2 * 8) / 4;
// alert(a);

// 2 * 8 = 16 / 4 = 4;

// let a = 2 * (8 / 4);
// alert(a);

// 8 / 4 = 2 * 2 = 4;