"use strict";

// №1⊗jsPmBsPrmF
// Пусть дана переменная r с радиусом круга. По соответствующей формуле найдите площадь круга и запишите ее в переменную s. Выведите содержимое этой переменной на экран.
// let r = prompt('Введите радиус');
// const PI = 3.14;
// let s = PI * (r ** 2);
// alert(s);

// №2⊗jsPmBsPrmF
// Пусть дана переменная a со стороной квадрата. Найдите площадь квадрата и запишите ее в переменную s. Выведите содержимое этой переменной на экран.

// let a = prompt('введите сторону квадрата');
// let s = a ** 2

// №3⊗jsPmBsPrmF
// Пусть даны переменные a и b со сторонами прямоугольника. Найдите площадь прямоугольника и запишите ее в переменную s. Выведите содержимое этой переменной на экран.

// let a = 23;
// let b = 12;
// let s = a * b;

// №4⊗jsPmBsPrmF
// Пусть даны переменные a и b со сторонами прямоугольника. Найдите периметр прямоугольника и запишите его в переменную p. Выведите содержимое этой переменной на экран.

// let a = 12;
// let b = 7;
// let p = 2 * (a + b);
// console.log(p);

// №5⊗jsPmBsPrmF
// Пусть дана переменная tc с температурой в градусах Цельсия. По соответствующей формуле выполните перевод этой температуры в градусы Фаренгейта.
// let tc = 36.6;
// let f = tc * 9 / 5 + 32;
// console.log(f);

// №6⊗jsPmBsPrmF
// Пусть дана переменная tf с температурой в градусах Фаренгейта. По соответствующей формуле выполните перевод этой температуры в градусы Цельсия.
let tf = 98;
let tc = (tf - 32) * 5 / 9;
console.log(tc);