// №1⊗jsPmUFRt
// Сделайте функцию, которая параметром принимает число, а возвращает куб этого числа. С помощью этой функции найдите куб числа 3 и запишите его в переменную res.

// function func(num){
//   return num ** 3;
// }

// let res = func(3);

// console.log(res);

// №2⊗jsPmUFRt
// Сделайте функцию, которая параметром принимает число, а возвращает квадратный корень из этого числа. С помощью этой функции найдите корень числа 3, затем найдите корень числа 4. Просуммируйте полученные результаты и выведите их в консоль.

// function func(num){
//   return Math.sqrt(num);
// }

// let res = func(3) + func(4);
// console.log(res);