"use strict";

// Возведите число 2 в 10-ю степень. Выведите результат на экран.
// let a = 2;
// alert(a ** 10);

// Не запуская код, определите, что выведется на экран:

// let a = 3 * 2 ** 3;
// alert(a);

//2 ** 3 * 3 = 24

// Не запуская код, определите, что выведется на экран:

// let a = (3 * 2) ** 3;
// alert(a);

//3 * 2 = 6 ** 3 = 216

// Не запуская код, определите, что выведется на экран:

// let a = 3 * 2 ** (3 + 1);
// alert(a);

//3 + 1 = 4, 2 ** 4 * 3


// let a = 2 ** 3 * 3;
// alert(a);

// 2 ** 3 * 3

// let a = 3 * 2 ** 3 * 3;
// alert(a);

//2 ** 3 * 3 * 3;