"use strict";

// ⊗jsPmMuAFP
// Автор следующего кода хотел сделать двухмерный массив:
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.
// let arr = [];

// for (let i = 0; i < 3; i++) {
//     arr[i] = [];
// 	for (let j = 1; j <= 5; j++) {
// 		arr[i].push(j);
// 	}
// }

// console.log(arr);

// №2⊗jsPmMuAFP
// Автор следующего кода хотел сделать двухмерный массив:
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// let arr = [];

// for (let i = 0; i < 3; i++) {
// 	arr[i] = [];
	
// 	for (let j = 1; j <= 5; j++) {
// 		arr[i].push(j);
// 	}
// }

// console.log(arr);

// №3⊗jsPmMuAFP
// Автор следующего кода хотел сделать двухмерный массив:
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.s
// let arr = [];

// for (let i = 0; i < 3; i++) {
//     arr[i] = [];
	
// 	for (let j = 1; j <= 5; j++) {
//         arr[i].push(j);
// 	}
// }
// console.log(arr);

// №1⊗jsPmMuAFO
// Сформируйте с помощью двух вложенных циклов следующий массив:
// [[1, 2], [3, 4], [5, 6], [7, 8]]

// let arr = [];
// let counter = 1;

// for(let i = 0; i < 4; i++){
//     arr[i] = [];
//     for(let j = 0; j < 2; j++){
//         arr[i].push(counter++);
//     }
// }

// console.log(arr);

// №2⊗jsPmMuAFO
// Сформируйте с помощью двух вложенных циклов следующий массив:

// [[2, 4, 6], [8, 10, 12], [14, 16, 18], [20, 22, 24]]

// let arr = [];
// let counter = 0;
// for(let i = 0; i < 4; i++){
//     arr[i] = [];
//     for(let j = 0; j < 3; j++){
//         arr[i].push(counter += 2);
//     }
// }

// console.log(arr);

// №3⊗jsPmMuAFO
// Сформируйте с помощью трех вложенных циклов следующий трехмерный массив:

// [[[1, 2], [3, 4]], [[5, 6], [7, 8]]]

// let arr = [];
// let counter = 1;
// for(let i = 0; i < 2; i++){
//     arr[i] = [];
//     for(let j = 0; j < 2; j++){
//         arr[i][j] = [];
//         for(let k = 0; k < 2; k++){
//             arr[i][j].push(counter++);
//         }
//     }
// }

// console.log(arr);

// №5⊗jsPmMuAFO
// Автор следующего кода хотел сделать вот такой массив:
//  [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// let arr = [];
// let k = 1;

// for (let i = 0; i < 3; i++) {
// 	arr[i] = [];
	
// 	for (let j = 0; j < 3; j++) {
// 		arr[i].push(k++);
// 	}
// }

// console.log(arr);

// №6⊗jsPmMuAFO
// Автор следующего кода хотел сделать вот такой массив:
// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// let arr = [];
// let k = 1;

// for (let i = 0; i < 3; i++) {
// 	arr[i] = [];
	
// 	for (let j = 0; j < 3; j++) {
// 		arr[i][j] = k;
// 		k++;
// 	}
// }

// console.log(arr);

// №7⊗jsPmMuAFO
// Автор следующего кода хотел сделать вот такой массив:
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];
// let k = 1;

// for (let i = 0; i < 3; i++) {
// 	arr[i] = [];
	
// 	for (let j = 0; j < 3; j++) {
// 		arr[i][j] = k;
// 		k++;
// 	}
// }

// console.log(arr);

// №8⊗jsPmMuAFO
// Автор следующего кода хотел сделать вот такой массив:
// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];
// for (let i = 0, k = 1; i < 3; i++) {
// 	arr[i] = [];
	
// 	for (let j = 0; j < 3; j++) {
// 		arr[i][j] = k++;
// 	}
// }
// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.


// №9⊗jsPmMuAFO

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];

// for (let i = 0, k = 1; i < 3; i++) {
// 	arr[i] = [];
	
// 	for (let j = 0; j < 3; j++) {
// 		arr[i][j] = k++;
// 	}
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// №10⊗jsPmMuAFO

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];

// for (let i = 0, k = 1; i < 3; i++) {
// 	arr[i] = [];
	
// 	for (let j = 0; j < 3; j++, k++) {
// 		arr[i][j] = k;
// 	}
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// №11⊗jsPmMuAFO

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];

// for (let i = 0, k = 1; i < 3; i++) {
// 	arr[i] = [];
	
// 	for (let j = 0; j < 3; j++) {
// 		arr[i][j] = k++;
// 	}
// }

// console.log(arr);// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// №12⊗jsPmMuAFO

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];
// let k = 1;

// for (let i = 0; i < 3; i++) {
// 	arr[i] = [];
	
// 	for (let j = 0; j < 3; j++) {
// 		arr[i][j] = k;
// 		k++;
// 	}
// }

// console.log(arr);
// Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.

// №13⊗jsPmMuAFO

// Автор следующего кода хотел сделать вот такой массив:

// [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
// Для этого был написан следующий код:

// let arr = [];

// for (let i = 0, k = 1; i < 3; i++) {
// 	arr[i] = [];
	
// 	for (let j = 0; j < 3; j++, k++) {
// 		arr[i][j] = k;
// 	}
// }

// console.log(arr);
// // Написанный код, однако, не делает задуманного. Найдите и исправьте ошибку автора.