"use strict";

// ⊗jsPmBsPmt
// Спросите возраст пользователя с помощью функции prompt. Выведите с помощью alert введенный пользователем возраст.

// let name = prompt('What is your name?');
// console.log(name);

// №2⊗jsPmBsPmt
// Переделайте приведенный выше код так, чтобы суммировались числа, а не строки.
// let num1 = prompt('Введите первое число');
// let num2 = prompt('Введите второе число');

// alert(+num1 + +num2); // сложит числа как строки

// №3⊗jsPmBsPmt
// С помощью функции prompt спросите у пользователя сторону квадрата. Выведите на экран площадь введенного квадрата.

// let a = prompt('Введите сторону квадрата');
// console.log(a ** 2);

// №4⊗jsPmBsPmt
// С помощью двух функций prompt спросите у пользователя стороны прямоугольника. Выведите на экран периметр введенного прямоугольника.
let a = prompt('Введите сторону прямоугольника a');
let b = prompt('Введите сторону прямоугольника b');

let res = a * b;