"use strict";

// №1⊗jsPmArInr
// Создайте массив со строками. Выведите его на экран с помощью функции alert, а также выведите его в консоль с помощью console.log.
// let arr = [1,2,3];
// console.log(arr[0], arr[1], arr[2]);

// №2⊗jsPmArEG
// Дан следующий массив:
// let arr = [1, 2, 3];
// console.log(arr[0], arr[1], arr[2]);
// Выведите на экран каждый из его элементов.

// №3⊗jsPmArEG
// Дан следующий массив:
// Выведите на экран сумму элементов этого массива.
// let arr = [1, 2, 3];

// console.log(arr[0] + arr[1] + arr[2]);

// №4⊗jsPmArEG
// Дан следующий массив:
let arr = ['a', 'b', 'c', 'd'];
// Выведите с помощью этого массива следующую строку:
// 'a+b+c+d'

console.log(`${arr[0]}+${arr[1]}+${arr[2]}`);