"use strict";

// Создайте переменную a со значением 10 и переменную b со значением 2. Выведите на экран их сумму, разность, произведение и частное (результат деления)

// let a = 10, b = 2;
// alert(a + b);
// alert(a - b);
// alert(a * b);
// alert(a / b);

// Создайте переменную c со значением 10 и переменную d со значением 5. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.

// let c = 10;
// let d = 5;
// let result = c + d;

// alert(result);

// let a = 1, b = 2, c = 3;
// alert(a + b + c);

// Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c.

// Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result. Выведите на экран значение переменной result.

let a = 10, b = 5;
let c = a - b;
let d = 7;
let result = c + d;
alert(result);