"use strict";

// №1⊗jsPmBsSC
// Создайте переменную str и присвойте ей строку '!!!'. Выведите значение этой переменной на экран.
// №2⊗jsPmBsSC
// Создайте переменную с текстом 'java' и переменную с текстом 'script'. С помощью этих переменных и операции сложения строк выведите на экран строку 'javascript'.
// №3⊗jsPmBsSC
// Создайте переменную с текстом 'hello' и переменную с текстом 'world'. С помощью этих переменных и операции сложения строк выведите на экран строку 'hello world'.

// let str = '!!!';
// alert('str');

// let str = 'jave';
// let text = 'script';
// alert(str + text)

let hell = 'hello';
let world = ' world';
alert(hell + world);